//Напишіть конструкцію if, щоб перевіряє, чи значення ціни товару не знаходиться між 1000 та 1900 включно.
//     Реалізуйте два варіанти, один з оператором НЕ !, а інший без цього оператора.
//     Результат виводити в консоль.


Price1 = (number1) => {
    if(!(1900>=number1) || !(1000<=number1)){
        console.log("Значення ціни товару НЕ знаходиться між 1000 та 1900 включно");
    } else {
        console.log("Значення ціни товару знаходиться між 1000 та 1900 включно");
    }
}
Price1 (999);




Price2 = (number2) => {
    if(1900<number2 || 1000>number2){
        console.log("Значення ціни товару НЕ знаходиться між 1000 та 1900 включно");
    } else {
        console.log("Значення ціни товару знаходиться між 1000 та 1900 включно");
    }
}
Price2 (999);

